# A call center Team performance vs PMI

In [3]:
!pip install mysql-connector-python

Requirement already satisfied: mysql-connector-python in c:\users\user\anaconda3\lib\site-packages (8.0.28)
Requirement already satisfied: protobuf>=3.0.0 in c:\users\user\anaconda3\lib\site-packages (from mysql-connector-python) (3.19.4)

In [4]:
import mysql.connector as conn

In [5]:
mydb=conn.connect(host ='localhost',user ='root',password ='123456789')

In [6]:
mydb

In [7]:
cursor =mydb.cursor()

In [13]:
cursor.execute("show databases")

In [14]:
cursor.fetchall()

[('ineuron',),
 ('information_schema',),
 ('mysql',),
 ('performance_schema',),
 ('sakila',),
 ('sys',),
 ('testsubhankar',),
 ('testsubhankar1',),
 ('testsudh',),
 ('testsudhineuron',),
 ('testsudhineuron1',),
 ('testsudhineuron2',),
 ('testsudhineuronsm',),
 ('world',)]

In [15]:
cursor =mydb.cursor()

In [16]:
cursor.execute("create database xyzbusinesssolution")

In [18]:
cursor.execute("show databases")

In [19]:
cursor.fetchall()

[('ineuron',),
 ('information_schema',),
 ('mysql',),
 ('performance_schema',),
 ('sakila',),
 ('sys',),
 ('testsubhankar',),
 ('testsubhankar1',),
 ('testsudh',),
 ('testsudhineuron',),
 ('testsudhineuron1',),
 ('testsudhineuron2',),
 ('testsudhineuronsm',),
 ('world',),
 ('xyzbusinesssolution',)]

In [26]:
cursor.execute('create table xyzbusinesssolution.teamgouri(employeeid INT(20),firstname VARCHAR(100),lastname VARCHAR(100),intime INT(20),outtime INT(20),teabreak1 INT(20),teabreak2 INT(20),lunchtime INT(20),bio INT(20),callcount INT(30),qualityscore INT(20),catscore INT(20))')

ProgrammingError: 1050 (42S01): Table 'teamgouri' already exists

In [21]:
cursor.execute('use xyzbusinesssolution')

In [22]:
cursor.execute('show tables')

In [23]:
cursor.fetchall()

[('teamgouri',)]

In [28]:
cursor.execute('insert into xyzbusinesssolution.teamgouri values(302509,"subhankar","mondal",1300,2200,15,12,22,8,120,85,100)')

In [29]:
cursor.execute('insert into xyzbusinesssolution.teamgouri values(312509,"monoj","mondal",1300,2200,15,15,25,5,120,93,90)')
cursor.execute('insert into xyzbusinesssolution.teamgouri values(362519,"sudanshu","kumar",1310,2210,15,12,22,8,105,85,95)')
cursor.execute('insert into xyzbusinesssolution.teamgouri values(202507,"souvick","dey",1300,2200,15,12,22,8,120,72,72)')
cursor.execute('insert into xyzbusinesssolution.teamgouri values(230250,"kiran","dutt",1301,2210,15,15,22,8,120,85,100)')

In [30]:
mydb.commit()

In [31]:
cursor.execute("select * from xyzbusinesssolution.teamgouri")

In [32]:
cursor.fetchall()

[(302509, 'subhankar', 'mondal', 13, 22, 15, 12, 22, 8, 120, 85, 100),
 (302509, 'subhankar', 'mondal', 1300, 2200, 15, 12, 22, 8, 120, 85, 100),
 (312509, 'monoj', 'mondal', 1300, 2200, 15, 15, 25, 5, 120, 93, 90),
 (362519, 'sudanshu', 'kumar', 1310, 2210, 15, 12, 22, 8, 105, 85, 95),
 (202507, 'souvick', 'dey', 1300, 2200, 15, 12, 22, 8, 120, 72, 72),
 (230250, 'kiran', 'dutt', 1301, 2210, 15, 15, 22, 8, 120, 85, 100)]

In [11]:
cursor.execute('delete from xyzbusinesssolution.teamgouri where employeeid =302509')

In [35]:
cursor.execute("select * from xyzbusinesssolution.teamgouri")

In [36]:
cursor.fetchall()

[(312509, 'monoj', 'mondal', 1300, 2200, 15, 15, 25, 5, 120, 93, 90),
 (362519, 'sudanshu', 'kumar', 1310, 2210, 15, 12, 22, 8, 105, 85, 95),
 (202507, 'souvick', 'dey', 1300, 2200, 15, 12, 22, 8, 120, 72, 72),
 (230250, 'kiran', 'dutt', 1301, 2210, 15, 15, 22, 8, 120, 85, 100)]

In [15]:
cursor.execute('insert into xyzbusinesssolution.teamgouri values(302509,"subhankar","mondal",1300,2200,15,12,22,8,125,83,100)')

In [17]:
cursor.execute("select * from xyzbusinesssolution.teamgouri")

In [18]:
cursor.fetchall()

[(312509, 'monoj', 'mondal', 1300, 2200, 15, 15, 25, 5, 120, 93, 90),
 (362519, 'sudanshu', 'kumar', 1310, 2210, 15, 12, 22, 8, 105, 85, 95),
 (202507, 'souvick', 'dey', 1300, 2200, 15, 12, 22, 8, 120, 72, 72),
 (230250, 'kiran', 'dutt', 1301, 2210, 15, 15, 22, 8, 120, 85, 100),
 (302509, 'subhankar', 'mondal', 1300, 2200, 15, 12, 22, 8, 125, 83, 100)]

In [19]:
cursor.execute('create table xyzbusinesssolution.teamriya(employeeid INT(20),firstname VARCHAR(100),lastname VARCHAR(100),intime INT(20),outtime INT(20),teabreak1 INT(20),teabreak2 INT(20),lunchtime INT(20),bio INT(20),callcount INT(30),qualityscore INT(20),catscore INT(20))')

In [20]:
cursor.execute('insert into xyzbusinesssolution.teamriya values(352528,"sakhi","prasad",1300,2200,15,15,25,5,98,93,100)')
cursor.execute('insert into xyzbusinesssolution.teamriya values(372511,"sonakshi","kumar",1310,2210,15,12,22,8,105,100,95)')
cursor.execute('insert into xyzbusinesssolution.teamriya values(212507,"sonam","dey",1300,2200,15,12,22,8,160,72,100)')
cursor.execute('insert into xyzbusinesssolution.teamriya values(230251,"kiran","pant",1301,2210,15,15,22,8,180,85,100)')
cursor.execute('insert into xyzbusinesssolution.teamriya values(330250,"monali","dutt",1301,2210,15,15,22,8,84,95,100)')

In [21]:
cursor.execute("select * from xyzbusinesssolution.teamriya")

In [22]:
cursor.fetchall()

[(352528, 'sakhi', 'prasad', 1300, 2200, 15, 15, 25, 5, 98, 93, 100),
 (372511, 'sonakshi', 'kumar', 1310, 2210, 15, 12, 22, 8, 105, 100, 95),
 (212507, 'sonam', 'dey', 1300, 2200, 15, 12, 22, 8, 160, 72, 100),
 (230251, 'kiran', 'pant', 1301, 2210, 15, 15, 22, 8, 180, 85, 100),
 (330250, 'monali', 'dutt', 1301, 2210, 15, 15, 22, 8, 84, 95, 100)]

In [25]:
cursor.execute("update xyzbusinesssolution.teamriya SET employeeid =395429 where employeeid =352528")

In [26]:
mydb.commit()

In [27]:
cursor.execute("select * from xyzbusinesssolution.teamriya")

In [28]:
cursor.fetchall()

[(395429, 'sakhi', 'prasad', 1300, 2200, 15, 15, 25, 5, 98, 93, 100),
 (372511, 'sonakshi', 'kumar', 1310, 2210, 15, 12, 22, 8, 105, 100, 95),
 (212507, 'sonam', 'dey', 1300, 2200, 15, 12, 22, 8, 160, 72, 100),
 (230251, 'kiran', 'pant', 1301, 2210, 15, 15, 22, 8, 180, 85, 100),
 (330250, 'monali', 'dutt', 1301, 2210, 15, 15, 22, 8, 84, 95, 100)]

In [29]:
cursor.execute('create table xyzbusinesssolution.teamkoushik(employeeid INT(20),firstname VARCHAR(100),lastname VARCHAR(100),intime INT(20),outtime INT(20),teabreak1 INT(20),teabreak2 INT(20),lunchtime INT(20),bio INT(20),callcount INT(30),qualityscore INT(20),catscore INT(20))')

In [30]:
cursor.execute('insert into xyzbusinesssolution.teamkoushik values(311125,"sarfaraj","ahmed",1302,2200,15,15,25,5,103,93,100)')
cursor.execute('insert into xyzbusinesssolution.teamkoushik values(202509,"sunny","kumar",1310,2210,15,12,22,8,106,100,95)')
cursor.execute('insert into xyzbusinesssolution.teamkoushik values(289781,"poulami","ghoshal",1300,2200,15,12,22,8,180,91,100)')
cursor.execute('insert into xyzbusinesssolution.teamkoushik values(396785,"kiran","mishra",1301,2210,15,15,22,8,210,85,100)')
cursor.execute('insert into xyzbusinesssolution.teamkoushik values(330250,"monali","sen",1330,2210,15,15,22,8,195,100,100)')

In [31]:
mydb.commit()

In [32]:
cursor.execute("select * from xyzbusinesssolution.teamkoushik")

In [33]:
cursor.fetchall()

[(311125, 'sarfaraj', 'ahmed', 1302, 2200, 15, 15, 25, 5, 103, 93, 100),
 (202509, 'sunny', 'kumar', 1310, 2210, 15, 12, 22, 8, 106, 100, 95),
 (289781, 'poulami', 'ghoshal', 1300, 2200, 15, 12, 22, 8, 180, 91, 100),
 (396785, 'kiran', 'mishra', 1301, 2210, 15, 15, 22, 8, 210, 85, 100),
 (330250, 'monali', 'sen', 1330, 2210, 15, 15, 22, 8, 195, 100, 100)]

In [34]:
mydb.commit()

In [35]:
import pandas as pd

In [39]:
df_first =pd.read_sql("select * from  xyzbusinesssolution.teamgouri",mydb)

In [40]:
df_first

,employeeid,firstname,lastname,intime,outtime,teabreak1,teabreak2,lunchtime,bio,callcount,qualityscore,catscore
0,312509,monoj,mondal,1300,2200,15,15,25,5,120,93,90
1,362519,sudanshu,kumar,1310,2210,15,12,22,8,105,85,95
2,202507,souvick,dey,1300,2200,15,12,22,8,120,72,72
3,230250,kiran,dutt,1301,2210,15,15,22,8,120,85,100
4,302509,subhankar,mondal,1300,2200,15,12,22,8,125,83,100

In [41]:
df_second =pd.read_sql(" select * from xyzbusinesssolution.teamriya",mydb)

In [42]:
df_second

,employeeid,firstname,lastname,intime,outtime,teabreak1,teabreak2,lunchtime,bio,callcount,qualityscore,catscore
0,395429,sakhi,prasad,1300,2200,15,15,25,5,98,93,100
1,372511,sonakshi,kumar,1310,2210,15,12,22,8,105,100,95
2,212507,sonam,dey,1300,2200,15,12,22,8,160,72,100
3,230251,kiran,pant,1301,2210,15,15,22,8,180,85,100
4,330250,monali,dutt,1301,2210,15,15,22,8,84,95,100

In [43]:
df_third =pd.read_sql("select * from xyzbusinesssolution.teamkoushik",mydb)

In [44]:
df_third

,employeeid,firstname,lastname,intime,outtime,teabreak1,teabreak2,lunchtime,bio,callcount,qualityscore,catscore
0,311125,sarfaraj,ahmed,1302,2200,15,15,25,5,103,93,100
1,202509,sunny,kumar,1310,2210,15,12,22,8,106,100,95
2,289781,poulami,ghoshal,1300,2200,15,12,22,8,180,91,100
3,396785,kiran,mishra,1301,2210,15,15,22,8,210,85,100
4,330250,monali,sen,1330,2210,15,15,22,8,195,100,100

In [64]:
merged_df = pd.merge(df_first,df_second,how='outer',on=['employeeid','firstname','lastname','intime','outtime','teabreak1','teabreak2','lunchtime','bio','callcount','qualityscore','catscore'])

In [65]:
merged_df

,employeeid,firstname,lastname,intime,outtime,teabreak1,teabreak2,lunchtime,bio,callcount,qualityscore,catscore
0,312509,monoj,mondal,1300,2200,15,15,25,5,120,93,90
1,362519,sudanshu,kumar,1310,2210,15,12,22,8,105,85,95
2,202507,souvick,dey,1300,2200,15,12,22,8,120,72,72
3,230250,kiran,dutt,1301,2210,15,15,22,8,120,85,100
4,302509,subhankar,mondal,1300,2200,15,12,22,8,125,83,100
5,395429,sakhi,prasad,1300,2200,15,15,25,5,98,93,100
6,372511,sonakshi,kumar,1310,2210,15,12,22,8,105,100,95
7,212507,sonam,dey,1300,2200,15,12,22,8,160,72,100
8,230251,kiran,pant,1301,2210,15,15,22,8,180,85,100
9,330250,monali,dutt,1301,2210,15,15,22,8,84,95,100

In [66]:
merged_df1 =pd.merge(merged_df,df_third, how='outer',on =['employeeid','firstname','lastname','intime','outtime','teabreak1','teabreak2','lunchtime','bio','callcount','qualityscore','catscore'])

In [67]:
merged_df1

,employeeid,firstname,lastname,intime,outtime,teabreak1,teabreak2,lunchtime,bio,callcount,qualityscore,catscore
0,312509,monoj,mondal,1300,2200,15,15,25,5,120,93,90
1,362519,sudanshu,kumar,1310,2210,15,12,22,8,105,85,95
2,202507,souvick,dey,1300,2200,15,12,22,8,120,72,72
3,230250,kiran,dutt,1301,2210,15,15,22,8,120,85,100
4,302509,subhankar,mondal,1300,2200,15,12,22,8,125,83,100
5,395429,sakhi,prasad,1300,2200,15,15,25,5,98,93,100
6,372511,sonakshi,kumar,1310,2210,15,12,22,8,105,100,95
7,212507,sonam,dey,1300,2200,15,12,22,8,160,72,100
8,230251,kiran,pant,1301,2210,15,15,22,8,180,85,100
9,330250,monali,dutt,1301,2210,15,15,22,8,84,95,100
10,311125,sarfaraj,ahmed,1302,2200,15,15,25,5,103,93,100
11,202509,sunny,kumar,1310,2210,15,12,22,8,106,100,95
12,289781,poulami,ghoshal,1300,2200,15,12,22,8,180,91,100
13,396785,kiran,mishra,1301,2210,15,15,22,8,210,85,100
14,330250,monali,sen,1330,2210,15,15,22,8,195,100,100

In [68]:
cursor.execute('create table xyzbusinesssolution.teamtarget(late INT(30),loginhr INT(30),calltargetmeet INT(40),quality INT(20),catscore INT(30),pmiamount INT(40))')

In [70]:
cursor.execute('insert into xyzbusinesssolution.teamtarget values(0,9,155,90,95,850)')
cursor.execute('insert into xyzbusinesssolution.teamtarget values(1,9,125,85,89,650)')
cursor.execute('insert into xyzbusinesssolution.teamtarget values(2,9,105,79,85,450)')
cursor.execute('insert into xyzbusinesssolution.teamtarget values(3,9,100,75,82,275)')
cursor.execute('insert into xyzbusinesssolution.teamtarget values(4,9,89,100,100,0)')

In [71]:
mydb.commit()

In [72]:
cursor.execute('select * from xyzbusinesssolution.teamtarget')

In [73]:
cursor.fetchall()

[(0, 9, 155, 90, 95, 850),
 (1, 9, 125, 85, 89, 650),
 (2, 9, 105, 79, 85, 450),
 (3, 9, 100, 75, 82, 275),
 (4, 9, 89, 100, 100, 0)]

In [74]:
pd.read_sql('select * from xyzbusinesssolution.teamtarget',mydb)

   late  loginhr  calltargetmeet  quality  catscore  pmiamount
0     0        9             155       90        95        850
1     1        9             125       85        89        650
2     2        9             105       79        85        450
3     3        9             100       75        82        275
4     4        9              89      100       100          0